/*
	File:		SlicesStrings.strings

	Contains:
	Copyright:	© 2007-2009 by Apple Inc., all rights reserved.
*/

//===========================================================================
// NOTE FOR LOCALIZERS:
// For any attributes overridden using the MDSlicesAttributeNameOverrides
// strings file, special care must be taken here. The KEY of the strings
// here will change from its english version to the name override.  For example:
//
// If MDSlicesAttributeNameOverrides.strings contains:
//		kMDItemTextContent = "TEXTCONTENT";
//
// Then replace any use of "Contents" (the english localization) in the KEYS
// of this file with the localization provided in MDSlicesAttributeNameOverrides.strings.
//
// In the above example, the localizer should change the text content localization below from:
//		"%[Contents]@ contains %@" = "%1$[Contents]@ contains %2$@";  // english version
//	to:
//		"%[TEXTCONTENT]@ contains %@" = "%1$[TEXTCONTENT]@ xxxxxx %2$@"; // localized version
//===========================================================================

/* Compound-type slices */
"%[Any]@ of the following are true" = "%1$[Alguna]@ de las siguientes es verdadera";
"%[All]@ of the following are true" = "%1$[Todas]@ las siguientes son verdaderas";
"%[None]@ of the following are true" = "%1$[Ninguna]@ de las siguientes es verdadera";

/* Specific kind strings */
"%[Kind]@ is %[any]@" = "%1$[Clase]@ es %2$[Cualquiera]@";
"%[Kind]@ is %[applications]@" = "%1$[Clase]@ es %2$[Aplicación]@";
"%[Kind]@ is %[documents]@" = "%1$[Clase]@ es %2$[Documento]@";
"%[Kind]@ is %[folders]@" = "%1$[Clase]@ es %2$[Carpeta]@";
"%[Kind]@ is %[images]@ %[all]@" = "%1$[Clase]@ es %2$[Imagen]@ %3$[Todas]@";
"%[Kind]@ is %[images]@ %[JPEG]@" = "%1$[Clase]@ es %2$[Imagen]@ %3$[JPEG]@";
"%[Kind]@ is %[images]@ %[TIFF]@" = "%1$[Clase]@ es %2$[Imagen]@ %3$[TIFF]@";
"%[Kind]@ is %[images]@ %[GIF]@" = "%1$[Clase]@ es %2$[Imagen]@ %3$[GIF]@";
"%[Kind]@ is %[images]@ %[PNG]@" = "%1$[Clase]@ es %2$[Imagen]@ %3$[PNG]@";
"%[Kind]@ is %[images]@ %[BMP]@" = "%1$[Clase]@ es %2$[Imagen]@ %3$[BMP]@";
"%[Kind]@ is %[music]@ %[all]@" = "%1$[Clase]@ es %2$[Música]@ %3$[Toda]@";
"%[Kind]@ is %[music]@ %[MP3]@" = "%1$[Clase]@ es %2$[Música]@ %3$[MP3]@";
"%[Kind]@ is %[music]@ %[AAC]@" = "%1$[Clase]@ es %2$[Música]@ %3$[AAC]@";
"%[Kind]@ is %[music]@ %[purchased]@" = "%1$[Clase]@ es %2$[Música]@ %3$[Comprada]@";
"%[Kind]@ is %[PDF]@" = "%1$[Clase]@ es %2$[PDF]@";
"%[Kind]@ is %[presentations]@" = "%1$[Clase]@ es %2$[Presentación]@";
"%[Kind]@ is %[text]@ %[all]@" = "%1$[Clase]@ es %2$[Texto]@ %3$[Todo]@";
"%[Kind]@ is %[text]@ %[plain text]@" = "%1$[Clase]@ es %2$[Texto]@ %3$[Texto normal]@";
"%[Kind]@ is %[text]@ %[rich text]@" = "%1$[Clase]@ es %2$[Texto]@ %3$[RTF]@";
"%[Kind]@ is %[text]@ %[HTML]@" = "%1$[Clase]@ es %2$[Texto]@ %3$[HTML]@";
"%[Kind]@ is %[text]@ %[XML]@" = "%1$[Clase]@ es %2$[Texto]@ %3$[XML]@";
"%[Kind]@ is %[text]@ %[source code]@" = "%1$[Clase]@ es %2$[Texto]@ %3$[Código fuente]@";
"%[Kind]@ is %[movies]@" = "%1$[Clase]@ es %2$[Película]@";
"%[Kind]@ is %[other]@ %@" = "%1$[Clase]@ es %2$[Otra]@ %3$@";

/* date-type attribute template, like kMDItemContentCreationDate */
"%@ is %[within last]@ %@ %[days]@" = "%1$@ es %2$[en los últimos]@ %3$@ %4$[días]@";
"%@ is %[within last]@ %@ %[weeks]@" = "%1$@ es %2$[en las últimas]@ %3$@ %4$[semanas]@";
"%@ is %[within last]@ %@ %[months]@" = "%1$@ es %2$[en los últimos]@ %3$@ %4$[meses]@";
"%@ is %[within last]@ %@ %[years]@" = "%1$@ es %2$[en los últimos]@ %3$@ %4$[años]@";
"%@ is %[exactly]@ %@" = "%1$@ es %2$[exactamente]@ %3$@";
"%@ is %[before]@ %@" = "%1$@ es %2$[antes de]@ %3$@";
"%@ is %[after]@ %@" = "%1$@ es %2$[después de]@ %3$@";
"%@ is %[today]@" = "%1$@ es %2$[hoy]@";
"%@ is %[yesterday]@" = "%1$@ es %2$[ayer]@";
"%@ is %[this week]@" = "%1$@ es %2$[esta semana]@";
"%@ is %[this month]@" = "%1$@ es %2$[este mes]@";
"%@ is %[this year]@" = "%1$@ es %2$[este año]@";

/* string-type attribute, like kMDItemDisplayName */
"%@ %[contains]@ %@" = "%1$@ %2$[contiene]@ %3$@";
"%@ %[begins with]@ %@" = "%1$@ %2$[empieza por]@ %3$@";
"%@ %[ends with]@ %@" = "%1$@ %2$[termina por]@ %3$@";
"%@ %[is]@ %@" = "%1$@ %2$[es]@ %3$@";
"%@ %[matches]@ %@" = "%1$@ %2$[coincide con]@ %3$@";

/* boolean-type attribute, like kMDItemFlashOnOff */
"%@ %[any]@" = "%1$@ %2$[Cualquiera]@";
"%@ %[yes]@" = "%1$@ %2$[Sí]@";
"%@ %[no]@" = "%1$@ %2$[No]@";

/* file visibility */
"%[File invisible]@ %[visible items]@" = "%1$[visibilidad de archivo]@ %2$[ítems visibles]@";
"%[File invisible]@ %[invisible items]@" = "%1$[visibilidad de archivo]@ %2$[ítems invisibles]@";
"%[File invisible]@ %[visible or invisible]@" = "%1$[visibilidad de archivo]@ %2$[visible o invisible]@";

/* raw query slice */
"%[Raw query]@ %@" = "%1$[consulta básica]@ %2$@";

/* file extension slice */
"%[File Extension]@ %[is]@ %@" = "%1$[Extensión de archivo]@ %2$[es]@ %3$@";

/* number-type attribute, like kMDItemAudioChannelCount */
"%@ %[equals]@ %@" = "%1$@ %2$[es igual a]@ %3$@";
"%@ %[is greater than]@ %@" = "%1$@ %2$[es superior a]@ %3$@";
"%@ %[is less than]@ %@" = "%1$@ %2$[es inferior a]@ %3$@";
"%@ %[is not]@ %@" = "%1$@ %2$[no es]@ %3$@";

/* text contents */
"%@ contains %@" = "%1$@ contiene %2$@";

/* Byte-sized attributes, such as kMDItemFSSize */
"%@ %[equals]@ %@ %[KB]@" = "%1$@ %2$[es igual a]@ %3$@ %4$[KB]@";
"%@ %[equals]@ %@ %[MB]@" = "%1$@ %2$[es igual a]@ %3$@ %4$[MB]@";
"%@ %[equals]@ %@ %[GB]@" = "%1$@ %2$[es igual a]@ %3$@ %4$[GB]@";
"%@ %[is less than]@ %@ %[KB]@" = "%1$@ %2$[es inferior a]@ %3$@ %4$[KB]@";
"%@ %[is less than]@ %@ %[MB]@" = "%1$@ %2$[es inferior a]@ %3$@ %4$[MB]@";
"%@ %[is less than]@ %@ %[GB]@" = "%1$@ %2$[es inferior a]@ %3$@ %4$[GB]@";
"%@ %[is greater than]@ %@ %[KB]@" = "%1$@ %2$[es superior a]@ %3$@ %4$[KB]@";
"%@ %[is greater than]@ %@ %[MB]@" = "%1$@ %2$[es superior a]@ %3$@ %4$[MB]@";
"%@ %[is greater than]@ %@ %[GB]@" = "%1$@ %2$[es superior a]@ %3$@ %4$[GB]@";
"%@ %[is not]@ %@ %[KB]@" = "%1$@ %2$[no es]@ %3$@ %4$[KB]@";
"%@ %[is not]@ %@ %[MB]@" = "%1$@ %2$[no es]@ %3$@ %4$[MB]@";
"%@ %[is not]@ %@ %[GB]@" = "%1$@ %2$[no es]@ %3$@ %4$[GB]@";

/* Duration-type attributes, such as kMDItemDurationSeconds */
"%@ %[equals]@ %@ hours %@ minutes %@ seconds" = "%1$@ %2$[es igual a]@ %3$@ horas %4$@ minutos %5$@ segundos";
"%@ %[is less than]@ %@ hours %@ minutes %@ seconds" = "%1$@ %2$[es inferior a]@ %3$@ horas %4$@ minutos %5$@ segundos";
"%@ %[is greater than]@ %@ hours %@ minutes %@ seconds" = "%1$@ %2$[es superior a]@ %3$@ horas %4$@ minutos %5$@ segundos";
"%@ %[is not]@ %@ hours %@ minutes %@ seconds" = "%1$@ %2$[no es]@ %3$@ horas %4$@ minutos %5$@ segundos";

/* This is for the slice that is added when a search string is present in the search field when saving a search. */
"%[Items matching text]@ %@" = "%1$[Ítems coinciden con el texto]@ %2$@";

/* Search System Files slice */
"%[SEARCH_SYSTEM_FILES]@ %[YES]@" = "%1$[archivos de sistema]@ %2$[están incluidos]@";
"%[SEARCH_SYSTEM_FILES]@ %[NO]@" = "%1$[archivos de sistema]@ %2$[no están incluidos]@";

/* Spotlight items slice */
"%[SEARCH_SPOTLIGHT_ITEMS]@ %[YES]@" = "%1$[ítems de Spotlight]@ %2$[están incluidos]@";
"%[SEARCH_SPOTLIGHT_ITEMS]@ %[NO]@" = "%1$[ítems de Spotlight]@ %2$[no están incluidos]@";

